Revit 2027 API
CableTrayConduitBase.IsValidLevelId Method
 Identifies if a level id is valid.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidLevelId(
	Document document,
	ElementId levelId
)
Public Shared Function IsValidLevelId (
	document As Document,
	levelId As ElementId
) As Boolean
public:
static bool IsValidLevelId(
	Document^ document,
	ElementId^ levelId
)
static member IsValidLevelId :
        document : Document *
        levelId : ElementId -> bool
Parameters
document Document
 The document.
levelId ElementId
 The level id.
Return Value
Boolean
 True if the level id is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace